In [1]:
import numpy as np
import pandas as pd

In [8]:
user = pd.DataFrame({'userid' : [1,2,3],'name' : ['A' ,'B' ,'C'] })

In [9]:
user

   userid name
0       1    A
1       2    B
2       3    C

In [26]:
# msgs = pd.DataFrame({'userid':[1,1,2] ,'msg' : ['hello','bye','hi']})

In [20]:
msgs = pd.DataFrame({'id':[1,1,2] ,'msg' : ['hello','bye','hi']})

In [12]:
msgs

   userid    msg
0       1  hello
1       1    bye
2       2     hi

In [15]:
pd.concat([user,msgs])

   userid name    msg
0       1    A    NaN
1       2    B    NaN
2       3    C    NaN
0       1  NaN  hello
1       1  NaN    bye
2       2  NaN     hi

In [16]:
pd.concat([user,msgs],axis=1)

   userid name  userid    msg
0       1    A       1  hello
1       2    B       1    bye
2       3    C       2     hi

In [17]:
# pd.merge(msgs,user)

   userid    msg name
0       1  hello    A
1       1    bye    A
2       2     hi    B

In [22]:
msgs.merge(user,left_on='id',right_on='userid') #if the common coln has diff names

   id    msg  userid name
0   1  hello       1    A
1   1    bye       1    A
2   2     hi       2    B

In [25]:
msgs.merge(user,left_on='id',right_on='userid').drop('id',axis=1) #removing duplicate coln from the final table

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B

In [27]:
msgs.merge(user,left_on='id',right_on='userid',how='outer').drop('id',axis=1)

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B
3    NaN       3    C

In [28]:
msgs.merge(user,left_on='id',right_on='userid',how='inner').drop('id',axis=1) #inner is default

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B

In [29]:
msgs.merge(user,left_on='id',right_on='userid',how='left').drop('id',axis=1) #inner is default

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B

In [30]:
msgs.merge(user,left_on='id',right_on='userid',how='right').drop('id',axis=1) #inner is default

     msg  userid name
0  hello       1    A
1    bye       1    A
2     hi       2    B
3    NaN       3    C